---
title: CentralModelContentionException
classe: Autodesk.Revit.Exceptions.CentralModelContentionException
namespace: Autodesk.Revit.Exceptions
eredita: Autodesk.Revit.Exceptions.CentralModelException
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# CentralModelContentionException

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CurrentUser { get; }` | `centralModelContentionException.CurrentUser` | String |
| `Void GetObjectData(SerializationInfo, StreamingContext)` | `centralModelContentionException.GetObjectData(info, context)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```